{
 "cells": [
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 从neo4j读entity、及其与time / event / locgrid 等node 与 relationship\n",
    "## 并实现：\n",
    "### 1.计算time0时间切片中，entity两两之间的距离，距离数据放到neo4j中的entity两两之间新建的关系中的distance属性里\n",
    "### 2.计算时间切片time0中，event发生地与所有entity的距离\n",
    "\n",
    "- ### 计划：\n",
    "  - #### 1.先用pyspark+neo4j connector 实现功能，不优化、质量和运行效率\n",
    "  - #### 2.优化：删除没必要的relationship，让计算更少、更快\n",
    "  \n",
    "  "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "OpenJDK 64-Bit Server VM warning: ignoring option PermSize=1024M; support was removed in 8.0\n",
      "2022-01-07 11:05:19,423 WARN util.NativeCodeLoader: Unable to load native-hadoop library for your platform... using builtin-java classes where applicable\n",
      "Setting default log level to \"WARN\".\n",
      "To adjust logging level use sc.setLogLevel(newLevel). For SparkR, use setLogLevel(newLevel).\n"
     ]
    }
   ],
   "source": [
    "from pyspark.sql import SparkSession\n",
    "import pyspark.sql.functions as F\n",
    "from utils.distance_utils import *\n",
    "import os\n",
    "os.environ['JAVA_HOME'] = \"/home/hadoop/app/java-se-8u41-ri/\"\n",
    "os.environ['PYSPARK_SUBMIT_ARGS'] = \"--jars file:////home/hadoop/app/spark-3.1.2-bin-without-hadoop/jars/neo4j-connector-apache-spark_2.12-4.1.0_for_spark_3.jar pyspark-shell\"\n",
    "\n",
    "# standalone - spark://hadoop171:7077 yarn\n",
    "# spark = (SparkSession.builder.master(\"yarn\").appName(\"car_event_neo4j\")\n",
    "#             #   .config(\"spark.yarn.am.memory\", \"8g\")\n",
    "#             #   .config(\"spark.yarn.am.cores\", \"4\")\n",
    "#             #   .config(\"spark.executor.memory\", \"8g\")\\\n",
    "#             #   .config(\"spark.executor.cores\", \"24\")\\\n",
    "#             #   .config(\"spark.exector.instances\", \"6\")\\\n",
    "#             #   .config(\"spark.num-executors\", \"100\")\\\n",
    "#               .getOrCreate())\n",
    "spark = (SparkSession.builder.master(\"local[*]\").appName(\"car_event_neo4j\")\\\n",
    "            # .config(\"spark.driver.port\", 7077)\n",
    "            # .config(\"spark.driver.host\", \"192.168.203.171\")\n",
    "            .config(\"spark.executor.memory\", \"8g\")\\\n",
    "            .config(\"spark.executor.cores\", \"12\")\\\n",
    "            .config(\"spark.exector.instances\", \"6\")\\\n",
    "            # .config(\"spark.num-executors\", \"100\")\\\n",
    "            .config(\"spark.driver.extraJavaOptions\", \"-XX:PermSize=1024M\")\\\n",
    "            .config(\"spark.executor.extraJavaOptions\", \"-verbose:gc -XX:+UseCompressedOops -XX:+PrintGCDetails -XX:+PrintGCDateStamps -XX:CMSInitiatingOccupancyFraction=60 -XX:PermSize=1024M\")\\\n",
    "            .config(\"spark.speculation\", \"false\")\\\n",
    "            .config(\"spark.sql.broadcastTimeout\", \"600\")\\\n",
    "            .config(\"spark.sql.shuffle.partitions\", \"800\")\\\n",
    "            .config(\"spark.default.parallelism\", \"600\")\\\n",
    "            .config(\"spark.memory.fraction\", \"0.9\")\\\n",
    "            .config(\"spark.dynamicAllocation.enabled\", \"true\")\\\n",
    "            .config(\"spark.dynamicAllocation.minExecutors\", \"1\")\\\n",
    "            .config(\"spark.dynamicAllocation.maxExecutors\", \"100\")\\\n",
    "            .config(\"spark.dynamicAllocation.executorIdleTimeout\", \"3s\")\\\n",
    "            .config(\"spark.shuffle.service.enabled\", \"true\")\\\n",
    "            .getOrCreate())"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "# dataframe show不换行\n",
    "spark.conf.set(\"spark.sql.repl.eagerEval.enabled\", True)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "NEO4J_URL = \"bolt://192.168.141.136:7687\"\n",
    "NEO4J_USERNAME = \"neo4j\"\n",
    "NEO4J_PASSWORD = \"sdc\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [],
   "source": [
    "dfr = (spark.read.format(\"org.neo4j.spark.DataSource\")\n",
    "  .option(\"url\", NEO4J_URL)\n",
    "  .option(\"authentication.basic.username\", NEO4J_USERNAME)\n",
    "  .option(\"authentication.basic.password\", NEO4J_PASSWORD)\n",
    "  .option(\"partitions\", 12)\n",
    ")\n",
    "  # .option(\"labels\", \"Device\")\\\n",
    "  # .load()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### 1.计算time0时间切片中，entity两两之间的距离，距离数据放到neo4j中的entity两两之间新建的关系spatial_location中的distance属性里"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 6.55 ms, sys: 1.34 ms, total: 7.89 ms\n",
      "Wall time: 19.8 s\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "                                                                                \r"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table border='1'>\n",
       "<tr><th>ent_id1</th><th>ent_name1</th><th>ent_id2</th><th>ent_name2</th><th>ent_grid_id</th><th>ent_grid_name</th><th>t2g_locgrid_id</th><th>t2g_locgrid_name</th></tr>\n",
       "<tr><td>entity295</td><td>538003936</td><td>entity296</td><td>538003998</td><td>locgrid296</td><td>00000111010100101...</td><td>locgrid295</td><td>00000111010110001...</td></tr>\n",
       "<tr><td>entity294</td><td>538003716</td><td>entity296</td><td>538003998</td><td>locgrid296</td><td>00000111010100101...</td><td>locgrid294</td><td>00000101011110100...</td></tr>\n",
       "<tr><td>entity293</td><td>538003673</td><td>entity296</td><td>538003998</td><td>locgrid296</td><td>00000111010100101...</td><td>locgrid293</td><td>00000101000001011...</td></tr>\n",
       "<tr><td>entity292</td><td>538003639</td><td>entity296</td><td>538003998</td><td>locgrid296</td><td>00000111010100101...</td><td>locgrid292</td><td>00000101111110011...</td></tr>\n",
       "<tr><td>entity291</td><td>538003562</td><td>entity296</td><td>538003998</td><td>locgrid296</td><td>00000111010100101...</td><td>locgrid291</td><td>00000111010110001...</td></tr>\n",
       "<tr><td>entity290</td><td>538003558</td><td>entity296</td><td>538003998</td><td>locgrid296</td><td>00000111010100101...</td><td>locgrid290</td><td>00000101100111011...</td></tr>\n",
       "<tr><td>entity289</td><td>538003501</td><td>entity296</td><td>538003998</td><td>locgrid296</td><td>00000111010100101...</td><td>locgrid289</td><td>00010000101010110...</td></tr>\n",
       "<tr><td>entity288</td><td>538003499</td><td>entity296</td><td>538003998</td><td>locgrid296</td><td>00000111010100101...</td><td>locgrid288</td><td>00010010001001100...</td></tr>\n",
       "<tr><td>entity287</td><td>538003274</td><td>entity296</td><td>538003998</td><td>locgrid296</td><td>00000111010100101...</td><td>locgrid287</td><td>00010010000000101...</td></tr>\n",
       "<tr><td>entity286</td><td>538003242</td><td>entity296</td><td>538003998</td><td>locgrid296</td><td>00000111010100101...</td><td>locgrid286</td><td>00000101000001011...</td></tr>\n",
       "<tr><td>entity285</td><td>538003181</td><td>entity296</td><td>538003998</td><td>locgrid296</td><td>00000111010100101...</td><td>locgrid285</td><td>00000101111100001...</td></tr>\n",
       "<tr><td>entity284</td><td>538003140</td><td>entity296</td><td>538003998</td><td>locgrid296</td><td>00000111010100101...</td><td>locgrid284</td><td>00000111010110010...</td></tr>\n",
       "<tr><td>entity283</td><td>538003020</td><td>entity296</td><td>538003998</td><td>locgrid296</td><td>00000111010100101...</td><td>locgrid283</td><td>00000001110111100...</td></tr>\n",
       "<tr><td>entity282</td><td>538002869</td><td>entity296</td><td>538003998</td><td>locgrid296</td><td>00000111010100101...</td><td>locgrid282</td><td>00000111010100000...</td></tr>\n",
       "<tr><td>entity281</td><td>538002823</td><td>entity296</td><td>538003998</td><td>locgrid296</td><td>00000111010100101...</td><td>locgrid281</td><td>00000101110010110...</td></tr>\n",
       "<tr><td>entity280</td><td>538002815</td><td>entity296</td><td>538003998</td><td>locgrid296</td><td>00000111010100101...</td><td>locgrid280</td><td>00000101000001011...</td></tr>\n",
       "<tr><td>entity279</td><td>538002635</td><td>entity296</td><td>538003998</td><td>locgrid296</td><td>00000111010100101...</td><td>locgrid279</td><td>00000100000111110...</td></tr>\n",
       "<tr><td>entity278</td><td>538002349</td><td>entity296</td><td>538003998</td><td>locgrid296</td><td>00000111010100101...</td><td>locgrid278</td><td>00000101111110110...</td></tr>\n",
       "<tr><td>entity277</td><td>538001656</td><td>entity296</td><td>538003998</td><td>locgrid296</td><td>00000111010100101...</td><td>locgrid277</td><td>00000101111110110...</td></tr>\n",
       "<tr><td>entity276</td><td>535541861</td><td>entity296</td><td>538003998</td><td>locgrid296</td><td>00000111010100101...</td><td>locgrid276</td><td>00000111010100101...</td></tr>\n",
       "</table>\n",
       "only showing top 20 rows\n"
      ],
      "text/plain": [
       "+---------+---------+---------+---------+-----------+--------------------+--------------+--------------------+\n",
       "|  ent_id1|ent_name1|  ent_id2|ent_name2|ent_grid_id|       ent_grid_name|t2g_locgrid_id|    t2g_locgrid_name|\n",
       "+---------+---------+---------+---------+-----------+--------------------+--------------+--------------------+\n",
       "|entity295|538003936|entity296|538003998| locgrid296|00000111010100101...|    locgrid295|00000111010110001...|\n",
       "|entity294|538003716|entity296|538003998| locgrid296|00000111010100101...|    locgrid294|00000101011110100...|\n",
       "|entity293|538003673|entity296|538003998| locgrid296|00000111010100101...|    locgrid293|00000101000001011...|\n",
       "|entity292|538003639|entity296|538003998| locgrid296|00000111010100101...|    locgrid292|00000101111110011...|\n",
       "|entity291|538003562|entity296|538003998| locgrid296|00000111010100101...|    locgrid291|00000111010110001...|\n",
       "|entity290|538003558|entity296|538003998| locgrid296|00000111010100101...|    locgrid290|00000101100111011...|\n",
       "|entity289|538003501|entity296|538003998| locgrid296|00000111010100101...|    locgrid289|00010000101010110...|\n",
       "|entity288|538003499|entity296|538003998| locgrid296|00000111010100101...|    locgrid288|00010010001001100...|\n",
       "|entity287|538003274|entity296|538003998| locgrid296|00000111010100101...|    locgrid287|00010010000000101...|\n",
       "|entity286|538003242|entity296|538003998| locgrid296|00000111010100101...|    locgrid286|00000101000001011...|\n",
       "|entity285|538003181|entity296|538003998| locgrid296|00000111010100101...|    locgrid285|00000101111100001...|\n",
       "|entity284|538003140|entity296|538003998| locgrid296|00000111010100101...|    locgrid284|00000111010110010...|\n",
       "|entity283|538003020|entity296|538003998| locgrid296|00000111010100101...|    locgrid283|00000001110111100...|\n",
       "|entity282|538002869|entity296|538003998| locgrid296|00000111010100101...|    locgrid282|00000111010100000...|\n",
       "|entity281|538002823|entity296|538003998| locgrid296|00000111010100101...|    locgrid281|00000101110010110...|\n",
       "|entity280|538002815|entity296|538003998| locgrid296|00000111010100101...|    locgrid280|00000101000001011...|\n",
       "|entity279|538002635|entity296|538003998| locgrid296|00000111010100101...|    locgrid279|00000100000111110...|\n",
       "|entity278|538002349|entity296|538003998| locgrid296|00000111010100101...|    locgrid278|00000101111110110...|\n",
       "|entity277|538001656|entity296|538003998| locgrid296|00000111010100101...|    locgrid277|00000101111110110...|\n",
       "|entity276|535541861|entity296|538003998| locgrid296|00000111010100101...|    locgrid276|00000111010100101...|\n",
       "+---------+---------+---------+---------+-----------+--------------------+--------------+--------------------+\n",
       "only showing top 20 rows"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "# 围绕时间切片time0 查出 t2g_locgrid 和 ent_grid，并在两者关联的entity之间建立 spatial_location 的关系\n",
    "ent_ent_grids_df = dfr.option(\"query\", \"\"\"\n",
    "    MATCH (e1: entity) - [: locatedin] -> (t2g_locgrid: locgrid) <- [t2g: time2loc] - (t: time {ID: \"time0\"})\n",
    "          - [t2e: time2entity] -> (e2: entity) - [: locatedin] -> (ent_grid: locgrid)\n",
    "          WHERE e1.ID <> e2.ID\n",
    "    RETURN e1.ID AS ent_id1, e1.name AS ent_name1, e2.ID AS ent_id2, e2.name AS ent_name2, \n",
    "           ent_grid.ID AS ent_grid_id, ent_grid.name AS ent_grid_name, \n",
    "           t2g_locgrid.ID AS t2g_locgrid_id, t2g_locgrid.name AS t2g_locgrid_name\n",
    "\"\"\").load()\n",
    "\n",
    "# ent_ent_grids_df.repartition(100)\n",
    "ent_ent_grids_df.cache()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### 1.1 计算t2g_locgrid 和 ent_grid之间经纬度偏移量和两个网格间的距离"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [],
   "source": [
    "def cal_grid_shift_and_distance(df, grid_name1, grid_name2):\n",
    "    \"\"\"\n",
    "    计算偏移量和距离，并放进df\n",
    "    \"\"\"\n",
    "    df2 = df.withColumn(\"lat_shift\", cal_lat_shift(F.col(grid_name1), F.col(grid_name2)))\\\n",
    "           .withColumn(\"lon_shift\", cal_lon_shift(F.col(grid_name1), F.col(grid_name2)))\\\n",
    "           .withColumn(\"distance\", F.pow(F.pow(F.col(\"lat_shift\"), 2) + F.pow(F.col(\"lon_shift\"), 2), 0.5))\n",
    "    return df2"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "[Stage 2:>                                                          (0 + 1) / 1]\r"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "+---------+---------+---------+---------+-----------+--------------------+--------------+--------------------+---------+---------+------------------+\n",
      "|  ent_id1|ent_name1|  ent_id2|ent_name2|ent_grid_id|       ent_grid_name|t2g_locgrid_id|    t2g_locgrid_name|lat_shift|lon_shift|          distance|\n",
      "+---------+---------+---------+---------+-----------+--------------------+--------------+--------------------+---------+---------+------------------+\n",
      "|entity295|538003936|entity296|538003998| locgrid296|00000111010100101...|    locgrid295|00000111010110001...|      269|       83|380.42344827836257|\n",
      "|entity294|538003716|entity296|538003998| locgrid296|00000111010100101...|    locgrid294|00000101011110100...|    -2718|        5|3843.8324625300725|\n",
      "+---------+---------+---------+---------+-----------+--------------------+--------------+--------------------+---------+---------+------------------+\n",
      "only showing top 2 rows\n",
      "\n",
      "CPU times: user 40.2 ms, sys: 11 ms, total: 51.2 ms\n",
      "Wall time: 2.87 s\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "                                                                                \r"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "grids_df = cal_grid_shift_and_distance(ent_ent_grids_df, \"ent_grid_name\", \"t2g_locgrid_name\")\n",
    "grids_df.show(2)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### 1.2 根据lat与lon的偏移量来判定direction，而不用每个方向都存一下distance。注意：每个判断都要用括号包住"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "[Stage 3:>                                                          (0 + 1) / 1]\r"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "+---------+---------+---------+---------+-----------+--------------------+--------------+--------------------+---------+---------+------------------+---------+\n",
      "|  ent_id1|ent_name1|  ent_id2|ent_name2|ent_grid_id|       ent_grid_name|t2g_locgrid_id|    t2g_locgrid_name|lat_shift|lon_shift|          distance|direction|\n",
      "+---------+---------+---------+---------+-----------+--------------------+--------------+--------------------+---------+---------+------------------+---------+\n",
      "|entity295|538003936|entity296|538003998| locgrid296|00000111010100101...|    locgrid295|00000111010110001...|      269|       83|380.42344827836257|       NE|\n",
      "|entity294|538003716|entity296|538003998| locgrid296|00000111010100101...|    locgrid294|00000101011110100...|    -2718|        5|3843.8324625300725|       SE|\n",
      "+---------+---------+---------+---------+-----------+--------------------+--------------+--------------------+---------+---------+------------------+---------+\n",
      "only showing top 2 rows\n",
      "\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "                                                                                \r"
     ]
    }
   ],
   "source": [
    "grids_df = grids_df.withColumn(\"direction\", (F.when((F.col(\"lat_shift\") > 0) & (F.col(\"lon_shift\") > 0), \"NE\")\n",
    "                                              .when((F.col(\"lat_shift\") > 0) & (F.col(\"lon_shift\") < 0), \"NW\")\n",
    "                                              .when((F.col(\"lat_shift\") < 0) & (F.col(\"lon_shift\") > 0), \"SE\")\n",
    "                                              .when((F.col(\"lat_shift\") < 0) & (F.col(\"lon_shift\") < 0), \"SW\")\n",
    "                                              .otherwise(\"\"))\n",
    "                                              )\n",
    "grids_df.show(2)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [],
   "source": [
    "# # If getNumPartitions is greater than 1 you might want to repartition it to 1\n",
    "# if grids_df.rdd.getNumPartitions() > 1:\n",
    "#     print(\"repartition 1\")\n",
    "#     grids_df.repartition(1)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### 1.3 创建spatial_location(entity 2 grid -- time 2 grid)关系，并设置distance和direction两个属性"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [],
   "source": [
    "# %%time\n",
    "\n",
    "# # 查找是否存在某一属性的节点：match (g:locgrid) where exists(g.ent_grid_id) return g limit 10\n",
    "# # 删除某一label的关系及其关联节点：MATCH (s)-[r:spatial_location]->(e) DELETE s, r, e\n",
    "\n",
    "# # relationship.source.save.mode = Match: 只有节点已存在才会建立关系，target同理\n",
    "# # node.keys、node.properties、relationship.properties的映射模式都是 -- dataframe的列名: Node中的属性名\n",
    "# (grids_df.write\n",
    "#     .format(\"org.neo4j.spark.DataSource\")\n",
    "#     .option(\"url\", NEO4J_URL)\n",
    "#     .option(\"authentication.type\", \"basic\")\n",
    "#     .option(\"authentication.basic.username\", NEO4J_USERNAME)\n",
    "#     .option(\"authentication.basic.password\", NEO4J_PASSWORD)\n",
    "#     .option(\"batch.size\", 2500)\n",
    "#     .option(\"transaction.retries\", \"10\")\n",
    "#     .option(\"transaction.retry.timeout\", \"1000\")\n",
    "#     .option(\"relationship.save.strategy\", \"keys\")\n",
    "#     .option(\"relationship\", \"spatial_location\")\n",
    "#     .option(\"relationship.source.save.mode\", \"Match\")\n",
    "#     .option(\"relationship.source.labels\", \":entity\")\n",
    "#     # .option(\"relationship.source.node.keys\", \"ID\")\n",
    "#     .option(\"relationship.source.node.keys\", \"ent_id1:ID\")\n",
    "#     # .option(\"relationship.source.node.properties\", \"ent_grid_id:ID\")\n",
    "#     .option(\"relationship.properties\", \"distance:distance,direction:direction\")\n",
    "#     .option(\"relationship.target.save.mode\", \"Match\")\n",
    "#     .option(\"relationship.target.labels\", \":entity\")\n",
    "#     # .option(\"relationship.target.node.keys\", \"ID\")\n",
    "#     .option(\"relationship.target.node.keys\", \"ent_id2:ID\")\n",
    "#     # .option(\"relationship.target.node.properties\", \"t2g_locgrid_id:ID\")\n",
    "#     .mode(\"Overwrite\")\n",
    "#     .save()\n",
    "# )"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### 2.计算时间切片time0中，event发生地与所有entity在time0时的所在grid的距离(注意：locgrid_event是网格)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 3.58 ms, sys: 1.37 ms, total: 4.95 ms\n",
      "Wall time: 375 ms\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table border='1'>\n",
       "<tr><th>eve_id</th><th>eve_name</th><th>eve_grid_id</th><th>eve_grid_name</th></tr>\n",
       "<tr><td>event0</td><td>Tsunami</td><td>locgrid_event0</td><td>00000101100111001...</td></tr>\n",
       "<tr><td>event1</td><td>earthquake</td><td>locgrid_event1</td><td>10000101010001101...</td></tr>\n",
       "<tr><td>event2</td><td>storm</td><td>locgrid_event2</td><td>00000111010001110...</td></tr>\n",
       "<tr><td>event3</td><td>mission</td><td>locgrid_event3</td><td>00000101010101110...</td></tr>\n",
       "<tr><td>event4</td><td>rescue</td><td>locgrid_event4</td><td>00010010000100001...</td></tr>\n",
       "</table>\n"
      ],
      "text/plain": [
       "+------+----------+--------------+--------------------+\n",
       "|eve_id|  eve_name|   eve_grid_id|       eve_grid_name|\n",
       "+------+----------+--------------+--------------------+\n",
       "|event0|   Tsunami|locgrid_event0|00000101100111001...|\n",
       "|event1|earthquake|locgrid_event1|10000101010001101...|\n",
       "|event2|     storm|locgrid_event2|00000111010001110...|\n",
       "|event3|   mission|locgrid_event3|00000101010101110...|\n",
       "|event4|    rescue|locgrid_event4|00010010000100001...|\n",
       "+------+----------+--------------+--------------------+"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%time\n",
    "# RETURN eve.ID AS eve_id, eve.name AS eve_name, eve_grid.ID AS eve_grid_id, eve_grid.name AS eve_grid_name, t.ID AS tm_id, ent.name AS ent_name, ent.ID AS ent_id, ent_grid.ID AS ent_grid_id, ent_grid.name AS ent_grid_name\n",
    "\n",
    "# 分开查，放到一条cypher查很耗资源\n",
    "\n",
    "eve_cypher = \"\"\"\n",
    "    MATCH (eve: event) - [loc: locatedin] -> (eve_grid: locgrid_event) RETURN eve.ID AS eve_id, eve.name AS eve_name, eve_grid.ID AS eve_grid_id, eve_grid.name AS eve_grid_name\n",
    "\"\"\"\n",
    "\n",
    "# ent_ent_grids_df已包含了，无需重复查询 大神博客真牛逼\n",
    "# ent_cypher = \"\"\"\n",
    "#     MATCH (ent_grid: locgrid) <- [t2g: time2loc] - (t: time {ID: \"time0\"}) - [t2e: time2entity] -> (ent: entity)\n",
    "#     RETURN ent.ID AS ent_id, ent_grid.ID AS ent_grid_id, ent_grid.name AS ent_grid_name\n",
    "# \"\"\"\n",
    "\n",
    "eve_grid_df = dfr.option(\"query\", eve_cypher).load()\n",
    "# eve_grid_df.repartition(10)\n",
    "eve_grid_df.cache()\n",
    "\n",
    "# ent_grid_df = dfr.option(\"query\", ent_cypher).load()\n",
    "# # ent_grid_df.repartition(10)\n",
    "# ent_grid_df.cache()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "5\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "                                                                                \r"
     ]
    },
    {
     "data": {
      "text/plain": [
       "87912"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "print(eve_grid_df.count())\n",
    "# print(ent_grid_df.count())\n",
    "\n",
    "ent_ent_grids_df.count()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "+-----------+--------------------+---------+---------+------+----------+--------------+--------------------+\n",
      "|ent_grid_id|       ent_grid_name|  ent_id1|ent_name1|eve_id|  eve_name|   eve_grid_id|       eve_grid_name|\n",
      "+-----------+--------------------+---------+---------+------+----------+--------------+--------------------+\n",
      "| locgrid296|00000111010100101...|entity295|538003936|event0|   Tsunami|locgrid_event0|00000101100111001...|\n",
      "| locgrid296|00000111010100101...|entity295|538003936|event1|earthquake|locgrid_event1|10000101010001101...|\n",
      "| locgrid296|00000111010100101...|entity295|538003936|event2|     storm|locgrid_event2|00000111010001110...|\n",
      "| locgrid296|00000111010100101...|entity295|538003936|event3|   mission|locgrid_event3|00000101010101110...|\n",
      "| locgrid296|00000111010100101...|entity295|538003936|event4|    rescue|locgrid_event4|00010010000100001...|\n",
      "+-----------+--------------------+---------+---------+------+----------+--------------+--------------------+\n",
      "only showing top 5 rows\n",
      "\n",
      "CPU times: user 6.73 ms, sys: 4.17 ms, total: 10.9 ms\n",
      "Wall time: 429 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "ent_event_grids_df = ent_ent_grids_df.select(\"ent_grid_id\", \"ent_grid_name\", \"ent_id1\", \"ent_name1\").join(F.broadcast(eve_grid_df))\n",
    "ent_event_grids_df.show(5)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "                                                                                \r"
     ]
    },
    {
     "data": {
      "text/plain": [
       "439560"
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "ent_event_grids_df.cache()\n",
    "ent_event_grids_df.count()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### 2.1 计算escape/complete阈值、是否可能要逃跑/完成任务(may_escape_or_complete:0 为escape，1为complete)、eve_grid 和 ent_grid之间经纬度偏移量和两个网格间的距离"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 8.97 ms, sys: 828 µs, total: 9.8 ms\n",
      "Wall time: 83.3 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "# if event_name[i]=='Tsunami' or event_name[i]=='earthquake' or event_name[i]=='storm':\n",
    "#             event_entity_relation='escape'\n",
    "#             event_threshold=5000\n",
    "\n",
    "ent_event_grids_df = ent_event_grids_df.withColumn(\"may_escape_or_complete\", F.when(F.col(\"eve_name\").isin(\"Tsunami\", \"earthquake\", \"storm\"), 0).otherwise(1))\\\n",
    "                                       .withColumn(\"event_threshold\", F.when(F.col(\"may_escape_or_complete\") == 0, 5000).otherwise(3000))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "+-----------+--------------------+---------+---------+------+----------+--------------+--------------------+----------------------+---------------+\n",
      "|ent_grid_id|       ent_grid_name|  ent_id1|ent_name1|eve_id|  eve_name|   eve_grid_id|       eve_grid_name|may_escape_or_complete|event_threshold|\n",
      "+-----------+--------------------+---------+---------+------+----------+--------------+--------------------+----------------------+---------------+\n",
      "| locgrid296|00000111010100101...|entity295|538003936|event0|   Tsunami|locgrid_event0|00000101100111001...|                     0|           5000|\n",
      "| locgrid296|00000111010100101...|entity295|538003936|event1|earthquake|locgrid_event1|10000101010001101...|                     0|           5000|\n",
      "| locgrid296|00000111010100101...|entity295|538003936|event2|     storm|locgrid_event2|00000111010001110...|                     0|           5000|\n",
      "+-----------+--------------------+---------+---------+------+----------+--------------+--------------------+----------------------+---------------+\n",
      "only showing top 3 rows\n",
      "\n",
      "+-----------+--------------------+---------+---------+------+--------+--------------+--------------------+----------------------+---------------+\n",
      "|ent_grid_id|       ent_grid_name|  ent_id1|ent_name1|eve_id|eve_name|   eve_grid_id|       eve_grid_name|may_escape_or_complete|event_threshold|\n",
      "+-----------+--------------------+---------+---------+------+--------+--------------+--------------------+----------------------+---------------+\n",
      "| locgrid296|00000111010100101...|entity295|538003936|event3| mission|locgrid_event3|00000101010101110...|                     1|           3000|\n",
      "| locgrid296|00000111010100101...|entity295|538003936|event4|  rescue|locgrid_event4|00010010000100001...|                     1|           3000|\n",
      "| locgrid296|00000111010100101...|entity294|538003716|event3| mission|locgrid_event3|00000101010101110...|                     1|           3000|\n",
      "+-----------+--------------------+---------+---------+------+--------+--------------+--------------------+----------------------+---------------+\n",
      "only showing top 3 rows\n",
      "\n"
     ]
    }
   ],
   "source": [
    "\n",
    "# ent_event_grids_df.filter(F.col(\"may_escape_or_complete\") == 0).show(3)\n",
    "# ent_event_grids_df.filter(F.col(\"may_escape_or_complete\") == 1).show(3)\n",
    "\n",
    "ent_event_grids_df.filter(F.col(\"may_escape_or_complete\") == F.lit(0)).show(3)\n",
    "ent_event_grids_df.filter(F.col(\"may_escape_or_complete\") == F.lit(1)).show(3)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 6.84 ms, sys: 946 µs, total: 7.79 ms\n",
      "Wall time: 67.5 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "# 计算偏移量和距离\n",
    "ent_event_grids_df = cal_grid_shift_and_distance(ent_event_grids_df, \"eve_grid_name\", \"ent_grid_name\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### 2.2 计算是否真的需要逃跑/完成任务"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "                                                                                \r"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "+-----------+--------------------+---------+---------+------+--------+--------------+--------------------+----------------------+---------------+---------+---------+------------------+-----------------------+\n",
      "|ent_grid_id|       ent_grid_name|  ent_id1|ent_name1|eve_id|eve_name|   eve_grid_id|       eve_grid_name|may_escape_or_complete|event_threshold|lat_shift|lon_shift|          distance|need_escape_or_complete|\n",
      "+-----------+--------------------+---------+---------+------+--------+--------------+--------------------+----------------------+---------------+---------+---------+------------------+-----------------------+\n",
      "| locgrid296|00000111010100101...|entity295|538003936|event0| Tsunami|locgrid_event0|00000101100111001...|                     0|           5000|     1849|     1594|2614.8808768278527|                   true|\n",
      "| locgrid296|00000111010100101...|entity295|538003936|event2|   storm|locgrid_event2|00000111010001110...|                     0|           5000|      139|      183| 196.5756851698602|                   true|\n",
      "| locgrid296|00000111010100101...|entity295|538003936|event4|  rescue|locgrid_event4|00010010000100001...|                     1|           3000|      296|    -1973|418.60721446243616|                   true|\n",
      "+-----------+--------------------+---------+---------+------+--------+--------------+--------------------+----------------------+---------------+---------+---------+------------------+-----------------------+\n",
      "only showing top 3 rows\n",
      "\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "[Stage 22:>                                                         (0 + 1) / 1]\r"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "+-----------+--------------------+---------+---------+------+----------+--------------+--------------------+----------------------+---------------+---------+---------+-----------------+-----------------------+\n",
      "|ent_grid_id|       ent_grid_name|  ent_id1|ent_name1|eve_id|  eve_name|   eve_grid_id|       eve_grid_name|may_escape_or_complete|event_threshold|lat_shift|lon_shift|         distance|need_escape_or_complete|\n",
      "+-----------+--------------------+---------+---------+------+----------+--------------+--------------------+----------------------+---------------+---------+---------+-----------------+-----------------------+\n",
      "| locgrid296|00000111010100101...|entity295|538003936|event1|earthquake|locgrid_event1|10000101010001101...|                     0|           5000|   -28591|      571|40433.77996180916|                  false|\n",
      "| locgrid296|00000111010100101...|entity295|538003936|event3|   mission|locgrid_event3|00000101010101110...|                     1|           3000|     4311|     -775|6096.674667390413|                  false|\n",
      "| locgrid296|00000111010100101...|entity294|538003716|event1|earthquake|locgrid_event1|10000101010001101...|                     0|           5000|   -28591|      571|40433.77996180916|                  false|\n",
      "+-----------+--------------------+---------+---------+------+----------+--------------+--------------------+----------------------+---------------+---------+---------+-----------------+-----------------------+\n",
      "only showing top 3 rows\n",
      "\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "                                                                                \r"
     ]
    }
   ],
   "source": [
    "# need_escape_or_complete: True 为需要，False为不需要\n",
    "ent_event_grids_df = ent_event_grids_df.withColumn(\"need_escape_or_complete\", F.when((F.col(\"distance\") < F.col(\"event_threshold\")), True).otherwise(False))\n",
    "ent_event_grids_df.filter(F.col(\"need_escape_or_complete\")).show(3)\n",
    "ent_event_grids_df.filter(~F.col(\"need_escape_or_complete\")).show(3)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [],
   "source": [
    "# 过滤出需要逃跑或完成任务的数据，然后写进neo4j 单机neo4j是真的慢\n",
    "need_escape_df = ent_event_grids_df.filter((F.col(\"may_escape_or_complete\") == 0) & F.col(\"need_escape_or_complete\"))\n",
    "need_complete_df = ent_event_grids_df.filter((F.col(\"may_escape_or_complete\") == 1) & F.col(\"need_escape_or_complete\"))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [],
   "source": [
    "# %%time\n",
    "\n",
    "# (need_escape_df.write\n",
    "#     .format(\"org.neo4j.spark.DataSource\")\n",
    "#     .option(\"url\", NEO4J_URL)\n",
    "#     .option(\"authentication.type\", \"basic\")\n",
    "#     .option(\"authentication.basic.username\", NEO4J_USERNAME)\n",
    "#     .option(\"authentication.basic.password\", NEO4J_PASSWORD)\n",
    "#     .option(\"batch.size\", 2500)\n",
    "#     .option(\"transaction.retries\", \"10\")\n",
    "#     .option(\"relationship.save.strategy\", \"keys\")\n",
    "#     .option(\"relationship\", \"escape\")\n",
    "#     .option(\"relationship.source.save.mode\", \"Match\")\n",
    "#     .option(\"relationship.source.labels\", \":entity\")\n",
    "#     .option(\"relationship.source.node.keys\", \"ent_id1:ID\")\n",
    "#     .option(\"relationship.properties\", \"distance\")\n",
    "#     .option(\"relationship.target.save.mode\", \"Match\")\n",
    "#     .option(\"relationship.target.labels\", \":event\")\n",
    "#     .option(\"relationship.target.node.keys\", \"eve_id:ID\")\n",
    "#     .mode(\"Overwrite\")\n",
    "#     .save()\n",
    "# )"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [],
   "source": [
    "# %%time\n",
    "\n",
    "# (need_complete_df.write\n",
    "#     .format(\"org.neo4j.spark.DataSource\")\n",
    "#     .option(\"url\", NEO4J_URL)\n",
    "#     .option(\"authentication.type\", \"basic\")\n",
    "#     .option(\"authentication.basic.username\", NEO4J_USERNAME)\n",
    "#     .option(\"authentication.basic.password\", NEO4J_PASSWORD)\n",
    "#     .option(\"batch.size\", 2500)\n",
    "#     .option(\"transaction.retries\", \"10\")\n",
    "#     .option(\"relationship.save.strategy\", \"keys\")\n",
    "#     .option(\"relationship\", \"complete\")\n",
    "#     .option(\"relationship.source.save.mode\", \"Match\")\n",
    "#     .option(\"relationship.source.labels\", \":entity\")\n",
    "#     .option(\"relationship.source.node.keys\", \"ent_id1:ID\")\n",
    "#     .option(\"relationship.properties\", \"distance\")\n",
    "#     .option(\"relationship.target.save.mode\", \"Match\")\n",
    "#     .option(\"relationship.target.labels\", \":event\")\n",
    "#     .option(\"relationship.target.node.keys\", \"eve_id:ID\")\n",
    "#     .mode(\"Overwrite\")\n",
    "#     .save()\n",
    "# )"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {},
   "outputs": [],
   "source": [
    "spark.stop()"
   ]
  }
 ],
 "metadata": {
  "interpreter": {
   "hash": "58798394b07394ee8044318957ca09326c8c0f84f9b73bea42b0a2031d5055fb"
  },
  "kernelspec": {
   "display_name": "Python 3.7.12 64-bit ('freelance_py37': conda)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.12"
  },
  "orig_nbformat": 4,
  "pycharm": {
   "stem_cell": {
    "cell_type": "raw",
    "metadata": {
     "collapsed": false
    },
    "source": []
   }
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
